hiepnguyen57/stm32f7_micarray/Apps/src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f7xx_it.h"
#include "cy8cmbr3.h"
#include "stripEffects.h"

#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include "waverecorder.h"
#include "DOA.h"
#include "pdm_filter.h"
#include "DSP.h"
#include "arm_math.h"
/** @addtogroup STM32F7xx_HAL_Examples
	* @{
	*/

/** @addtogroup UART_TwoBoards_ComIT
	* @{
	*/ 

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define I2CX_TIMING             0x40912732 //0x40912732 //0x00303D5D; 0x00A0689A
#define I2C_ADDRESS 			0xD0
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
uint8_t aTxBuffer[] = "Hello Worldd";
uint8_t aRxBuffer[RXBUFFERSIZE];
CY8CMBR3116_Result result;

LPTIM_HandleTypeDef             LptimHandle;

extern Mic_Array_Data Buffer1,Buffer2,Buffer3;

extern uint16_t WaveRecord_flgIni;
extern uint32_t EnergySound,EnergyError;

extern __IO int16_t SPI1_stNipple,I2S1_stNipple, I2S2_stNipple,SPI4_stNipple;
extern __IO   uint8_t I2S1_stPosShft,I2S2_stPosShft,SPI4_stPosShft;
extern USBD_AUDIO_ItfTypeDef  USBD_AUDIO_fops;
extern __IO uint8_t  swtBufUSBOut;
extern __IO uint8_t flgRacing;
extern __IO GPIO_PinState stMIC56;
extern __IO GPIO_PinState stMIC56Old;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c4;

USBH_HandleTypeDef hUSBHost;
USBD_HandleTypeDef hUSBDDevice;
AUDIO_ApplicationTypeDef appli_state = APPLICATION_IDLE;//APPLICATION_IDLE

SPI_HandleTypeDef hspi4;
GPIO_InitTypeDef GPIO_INS;
Mic_Array_Coef_f FacMic;
Audio_Out OutData;	  


int16_t bufBeam1[ PAR_N  ];
int16_t bufBeam2[ PAR_N  ];

float CrssCorVal78,CrssCorVal14,CrssCorVal25,CrssCorVal63;

__IO uint16_t  WaveRec_idxSens4,WaveRec_idxSens3;
__IO uint16_t  WaveRec_idxSens1,WaveRec_idxSens2;
__IO uint16_t  WaveRec_idxSens5,WaveRec_idxSens6;
__IO uint8_t   flgDlyUpd; 
__IO uint8_t   flg10ms;

uint8_t buffer_switch = BUF3_PLAY; /* record data to buffer1 */
uint8_t Command_index=1;
uint8_t swtCase1Mic56;
uint8_t Direction;

#if (DEBUG)
uint8_t  pUARTBuf[128];
#endif

extern __IO uint16_t idxFrmUSB;
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void CPU_CACHE_Enable(void);
static void USB_Audio_Config(void);
void PWMInit(void);
void I2C1_Init(void);
void I2C4_Init(void);
void GPIO_INT_Init(void);
/* Private functions ---------------------------------------------------------*/
void OUPUT_PIN_GENERATE_PULSE(void)
{
	HAL_GPIO_WritePin(CPU_OUTPUT_GPIO_PORT, CPU_OUTPUT_PIN, GPIO_PIN_SET);
	HAL_GPIO_WritePin(CPU_OUTPUT_GPIO_PORT, CPU_OUTPUT_PIN, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(CPU_OUTPUT_GPIO_PORT, CPU_OUTPUT_PIN, GPIO_PIN_SET);
}
/*--------------INLINE FUNCTION-----------------------------------------------*/
inline static void BF_Update(void)
{       
	  /* Hafl buffer is filled in by I2S data stream in */
	  if((flgDlyUpd==0))
	  {
			uint8_t stDirBeam, stOption;

			stDirBeam = 0;
			stOption =1;

			flgDlyUpd = 1; 
/*-------------------------------------------------------------------------------------------------------------
			  
	Sequence  Record Data                     Processing Data                 Player Data
			  
	1-------  Buffer1                         Buffer2                         Buffer3
			  
	2-------  Buffer3                         Buffer1                         Buffer2		  
			  
	3-------  Buffer2                         Buffer3                         Buffer1 
 ---------------------------------------------------------------------------------------------------------------*/
			/* Processing Data */
			switch (buffer_switch)  //buffer_switch
			{             
				case BUF1_PLAY:                    
					/* Sound Source Localization */
					Direction = DOACalc(&Buffer3);

