hiepnguyen57/stm32f7_micarray/Apps/src/main.c
					// if (HAL_LPTIM_PWM_Start(&LptimHandle, 359, Direction*60-1) != HAL_OK)
					//   {
					//      ////Error_Handler();
					//   }
					
					if (stOption==0)
					{
						/* Summing in Buffer3 */
						BeamFormingSD(&Buffer3,stDirBeam,(int16_t *)bufBeam1);

						for (uint16_t i=0; i< PAR_N; i++)
						{
							 Buffer3.bufMIC1[i] = bufBeam1[i];
						}
					}
					else
					{
						OutData.bufMIC1 = bufBeam1;
						OutData.bufMIC2 = bufBeam2;
						/* Beam on forward and backward of sound source */
						BeamFormingSDCom(&Buffer3,stDirBeam,OutData);

						for (uint16_t i=0; i< PAR_N; i++)
						{
							 Buffer3.bufMIC1[i] = bufBeam1[i];
							 Buffer3.bufMIC2[i] = bufBeam2[i];
						}
					}               
					break;
				case BUF2_PLAY:
					/* Sound Source Localization */
					Direction = DOACalc(&Buffer1);
					// if (HAL_LPTIM_PWM_Start(&LptimHandle, 359, Direction*60-1) != HAL_OK)
					// {
					//     ////Error_Handler();
					// }
					if (stOption==0)
					{
						/* Summing in Buffer3 */
						BeamFormingSD(&Buffer1,stDirBeam,(int16_t *)bufBeam1);
						for (uint16_t i=0; i< PAR_N; i++)
						{
							 Buffer1.bufMIC1[i] = bufBeam1[i];
						}
					}
					else
					{
						OutData.bufMIC1 = bufBeam1;
						OutData.bufMIC2 = bufBeam2;
						/* Beam on forward and backward of sound source */
						BeamFormingSDCom(&Buffer1,stDirBeam,OutData);
						for (uint16_t i=0; i< PAR_N; i++)
						{
							 Buffer1.bufMIC1[i] = bufBeam1[i];
							 Buffer1.bufMIC2[i] = bufBeam2[i];
						}
					 }
				break;
							
			   case BUF3_PLAY:
				
					/* Sound Source Localization */
					Direction = DOACalc(&Buffer2);
					// if (HAL_LPTIM_PWM_Start(&LptimHandle, 359, Direction*60-1) != HAL_OK)
					// {
					//      ////Error_Handler();
					// }
					if (stOption==0)
					{
						/* Summing in Buffer3 */
						BeamFormingSD(&Buffer2,stDirBeam,(int16_t *)bufBeam1);
						for (uint16_t i=0; i< PAR_N; i++)
						{
							 Buffer2.bufMIC1[i] = bufBeam1[i];
						}                        
					}
					else
					{
						OutData.bufMIC1 = bufBeam1;
						OutData.bufMIC2 = bufBeam2;
						/* Beam on forward and backward of sound source */
						BeamFormingSDCom(&Buffer2,stDirBeam,OutData);
						for (uint16_t i=0; i< PAR_N; i++)
						{
							 Buffer2.bufMIC1[i] = bufBeam1[i];
							 Buffer2.bufMIC2[i] = bufBeam2[i];
						}
					 }

				break;
							
				default:
					break;
			   
		}
			
		AudioPlayerUpd();
	  }

}


inline static void Audio_Play_Out(void)
{

/*-------------------------------------------------------------------------------------------------------------
			  
	Sequence  Record Data                     Processing Data                 Player Data
			  
	1-------  Buffer1                         Buffer2                          Buffer3
			  
	2-------  Buffer3                         Buffer1                           Buffer2		  
			  
	3-------  Buffer2                         Buffer3                           Buffer1 
 ---------------------------------------------------------------------------------------------------------------*/
	flgRacing=0;

#if USB_STREAMING
	AudioUSBSend(idxFrmUSB);
#endif

	++idxFrmUSB;
	/* if player is finished for curent buffer                                  */ 
	if (idxFrmUSB == PAR_N/(AUDIO_SAMPLING_FREQUENCY/1000))
	{

	   RESET_IDX
	   idxFrmUSB=0;
	  switch (buffer_switch)
	  {
		  case BUF1_PLAY:
			  /* set flag for switch buffer */		  
			  buffer_switch = BUF3_PLAY;
			  break;
		   case BUF2_PLAY:
			  /* set flag for switch buffer */
			  buffer_switch = BUF1_PLAY;        
			  break;
		   case BUF3_PLAY:
			  /* set flag for switch buffer */		  
			  buffer_switch = BUF2_PLAY;
			  break;
		   default:
			  break;
	  }
	}
}


/**
	* @brief  Main program
	* @param  None
	* @retval None
	*/
int main(void)
{
	/* Enable the CPU Cache */
	CPU_CACHE_Enable();
	HAL_Init();

	/* Configure the system clock to 216 MHz */
	SystemClock_Config();
	log_init();

	BSP_AUDIO_OUT_ClockConfig(AUDIO_FREQ, NULL);

	/* Pin configuration for audio */
	Codec_GPIO_Init();

	/* Configure EXTI Line0 (connected to PB0 pin) in interrupt mode */
	MBR3_HOST_INT_Config();
	GPIO_INT_Init();

	//Config i2c bus
	I2C1_Init();
	I2C4_Init();

	STA321MP_Ini();

	/* Configure MBR3 */
	result = ConfigureMBR3(&hi2c1);
	if(result != CY8CMBR3116_Result_OK)
	{
		logs_error("Configure MBR3");
	}

	/* Configure LED RING */
	ws281x_init();

	/* PWM output */
	PWMInit();

	/* Init Superdirective Beamforming */
	BeamFormingSD_Init();

	/* 2 channels:16Khz Audio USB */
	USB_Audio_Config();

	__disable_irq();
	MIC1TO6_Init();
	StartRecord();
	__enable_irq();

	while(1)
	{
		BF_Update();
// 		if (flg10ms==1)
// 		{
// 			flg10ms=0;  
// #if DEBUG
// 			sprintf((char *)(pUARTBuf),"Direction: %3d\r\n",Direction*60);
// 			printf("%s\r\n", pUARTBuf);
// #endif
// 		}
	}
}


/**
	* @brief  System Clock Configuration
	*         The system Clock is configured as follow : 
	*            System Clock source            = PLL (HSE)
	*            SYSCLK(Hz)                     = 216000000
	*            HCLK(Hz)                       = 216000000
	*            AHB Prescaler                  = 1
	*            APB1 Prescaler                 = 4
	*            APB2 Prescaler                 = 2
	*            HSE Frequency(Hz)              = 25000000
	*            PLL_M                          = 25
	*            PLL_N                          = 432
	*            PLL_P                          = 2
	*            PLL_Q                          = 9
	*            VDD(V)                         = 3.3
	*            Main regulator output voltage  = Scale1 mode
	*            Flash Latency(WS)              = 7
	* @param  None
	* @retval None
	*/

void SystemClock_Config(void)
{
	RCC_ClkInitTypeDef RCC_ClkInitStruct;
	RCC_OscInitTypeDef RCC_OscInitStruct;
	RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;
	HAL_StatusTypeDef ret = HAL_OK;

	/* Enable HSE Oscillator and activate PLL with HSE as source */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
	RCC_OscInitStruct.HSEState = RCC_HSE_ON;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
	RCC_OscInitStruct.PLL.PLLM = 25;
	RCC_OscInitStruct.PLL.PLLN = 432;  // 432
	RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
	RCC_OscInitStruct.PLL.PLLQ = 9;

	ret = HAL_RCC_OscConfig(&RCC_OscInitStruct);
	if(ret != HAL_OK)
	{
		_Error_Handler(__FILE__, __LINE__);
	}

	/* Activate the OverDrive to reach the 216 MHz Frequency */
	ret = HAL_PWREx_EnableOverDrive();
	if(ret != HAL_OK)
	{
		_Error_Handler(__FILE__, __LINE__);
	}

	/* Select PLLSAI output as USB clock source */
	PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_CLK48 ;
	PeriphClkInitStruct.Clk48ClockSelection = RCC_CLK48SOURCE_PLLSAIP;

  
