hiepnguyen57/stm32f7_micarray/Apps/src/main.c
void GPIO_INT_Init(void)
{
    GPIO_InitTypeDef    GPIO_Init;

    CPU_INPUT_GPIO_CLK_ENABLE();
    CPU_OUTPUT_GPIO_CLK_ENABLE();

    //fixed error cut PD0 line
	__HAL_RCC_GPIOD_CLK_ENABLE();

	// Configure PE0 as output pin
    GPIO_Init.Pin   = CPU_OUTPUT_PIN;
    GPIO_Init.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_Init.Pull  = GPIO_PULLUP;
    GPIO_Init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    HAL_GPIO_Init(CPU_OUTPUT_GPIO_PORT, &GPIO_Init);

    /* Configure PB7 pin as input floating */
    GPIO_Init.Mode = GPIO_MODE_IT_FALLING;
    GPIO_Init.Pull = GPIO_NOPULL;
    GPIO_Init.Pin  = CPU_INPUT_PIN;
    HAL_GPIO_Init(CPU_INPUT_GPIO_PORT, &GPIO_Init);

    //fixed error cut PD0 line, remove in new version
    GPIO_Init.Mode = GPIO_MODE_INPUT;
    GPIO_Init.Pull = GPIO_NOPULL;
    GPIO_Init.Pin  = GPIO_PIN_0;
    HAL_GPIO_Init(GPIOD, &GPIO_Init);

    /* Enable adn set EXTI Line7 Interrupt */
    HAL_NVIC_SetPriority(EXTI9_5_IRQn, 0, 1);
    HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);
}

void HAL_I2S_TxCpltCallback(I2S_HandleTypeDef *hi2s)
{

}
void SubFrameFinished(void)
{
	Audio_Play_Out();
}

void PWMInit(void)
{
	RCC_PeriphCLKInitTypeDef        RCC_PeriphCLKInitStruct;

	/* ### - 1 - Re-target the LSE to Clock the LPTIM Counter ################# */
	/* Select the LSE clock as LPTIM peripheral clock */
	RCC_PeriphCLKInitStruct.PeriphClockSelection = RCC_PERIPHCLK_LPTIM1;
	RCC_PeriphCLKInitStruct.Lptim1ClockSelection = RCC_LPTIM1CLKSOURCE_LSE;  
	HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphCLKInitStruct);

	/* ### - 2 - Initialize the LPTIM peripheral ############################## */
	/*
	*  Instance        = LPTIM1
	*  Clock Source    = APB or LowPowerOSCillator (in this example LSI is
	*                    already selected from the RCC stage)
	*  Counter source  = External event.
	*  Clock prescaler = 1 (No division)
	*  Counter Trigger = Software trigger
	*  Output Polarity = High
	*  Update mode     = Immediate (Registers are immediately updated after any
	*                    write access) 
	*/

	LptimHandle.Instance = LPTIM1;
	LptimHandle.Init.Clock.Source    = LPTIM_CLOCKSOURCE_APBCLOCK_LPOSC;
	LptimHandle.Init.Clock.Prescaler = LPTIM_PRESCALER_DIV1;  
	LptimHandle.Init.CounterSource   = LPTIM_COUNTERSOURCE_INTERNAL;
	LptimHandle.Init.Trigger.Source  = LPTIM_TRIGSOURCE_SOFTWARE; 
	LptimHandle.Init.OutputPolarity  = LPTIM_OUTPUTPOLARITY_HIGH;
	LptimHandle.Init.UpdateMode      = LPTIM_UPDATE_IMMEDIATE;

	/* Initialize LPTIM peripheral according to the passed parameters */
	if (HAL_LPTIM_Init(&LptimHandle) != HAL_OK)
	{
		_Error_Handler(__FILE__, __LINE__);
	}

	/* ### - 3 - Start counting in interrupt mode ############################# */
	/*
	*  Period = 99
	*  Pulse  = 49
	*  According to this configuration, the duty cycle will be equal to 50%
	*/
	if (HAL_LPTIM_PWM_Start(&LptimHandle, 359, 0) != HAL_OK)
	{
		_Error_Handler(__FILE__, __LINE__);
	}
}

void EXTI4_IRQHandler(void)
{
	/* EXTI line interrupt detected */
	if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_4) != RESET)
	{
		__HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_4);
	}
}


/**
  * @brief  This function handles External line 0 interrupt request.
  * @param  None
  * @retval None
  */
void EXTI0_IRQHandler(void)
{
	/* EXTI line 0 interrupt detected */
	if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_0) != RESET)
	{
		//Read button status
		result = ReadandDisplaySensorStatus(&hi2c1);
		if(result != CY8CMBR3116_Result_OK)
		{
			logs_error("CYPRESS read status");
		}
	}
	__HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_0);
	HAL_GPIO_EXTI_Callback(GPIO_PIN_0);

}

/**
  * @brief  This function handles External line [9:5] interrupt request.
  * @param  None
  * @retval None
  */
void EXTI9_5_IRQHandler(void)
{
	printf("PB7 interrupt here\r\n");
	/* EXTI line 7 interrupt detected */
	if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_7) != RESET)
	{
		//do something here
	}
	__HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_7);
	HAL_GPIO_EXTI_Callback(GPIO_PIN_7);

}


static void USB_Audio_Config(void)
{
#if (USB_STREAMING)	
	/* Initialize USB descriptor basing on channels number and sampling frequency */
	USBD_AUDIO_Init_Microphone_Descriptor(&hUSBDDevice, AUDIO_SAMPLING_FREQUENCY, AUDIO_CHANNELS);
	/* Init Device Library */
	USBD_Init(&hUSBDDevice, &AUDIO_Desc, 0);
	/* Add Supported Class */
	USBD_RegisterClass(&hUSBDDevice, &USBD_AUDIO);
	/* Add Interface callbacks for AUDIO Class */  
	USBD_AUDIO_RegisterInterface(&hUSBDDevice, &USBD_AUDIO_fops);
	/* Start Device Process */
	USBD_Start(&hUSBDDevice);                          
#endif 
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
	/* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	while(1)
	{
	}
	/* USER CODE END Error_Handler_Debug */
}

/**
	* @brief  CPU L1-Cache enable.
	* @param  None
	* @retval None
	*/
static void CPU_CACHE_Enable(void)
{
	/* Enable I-Cache */
	SCB_EnableICache();

	/* Enable D-Cache */
	SCB_EnableDCache();
}

#ifdef  USE_FULL_ASSERT
/**
	* @brief  Reports the name of the source file and the source line number
	*         where the assert_param error has occurred.
	* @param  file: pointer to the source file name
	* @param  line: assert_param error line source number
	* @retval None
	*/
void assert_failed(uint8_t* file, uint32_t line)
{ 
	/* User can add his own implementation to report the file name and line number,
		 ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

	/* Infinite loop */
	while (1)
	{
	}
}
#endif

/**
	* @}
	*/

/**
	* @}
	*/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
